Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/losing_your_job/losing_your_job.html.txt.tmx
Source language: en
Languages: ga

source: It is widely recognised that losing your job can be one of the most difficult times of your life
ga: Tuigtear go forleathan gur cor fíorchrua i saol duine ar bith é a phost a chailliúint

source: This document is an introduction to the range of issues that you need to consider when you lose your job
ga: Méar ar eolas é an doiciméad seo ar raon ceisteanna a chaithfidh tú a chur san áireamh má chailleann tú do phost

source: If you lose your job you may have been made redundant or you may have been dismissed
ga: Má tá do phost caillte agat b'fhéidir gur fágadh iomarcach thú nó b'fhéidir gur briseadh thú

source: If it is a redundancy situation you may qualify for a redundancy payment. You can find out how your redundancy payment is taxed
ga: Más ceist iomarcaíochta é, b'fhéidir go bhfuil teideal agat ar íocaíocht iomarcaíochta

source: If you have been let go from your job, you should check that your employer had fair grounds for your dismissal
ga: Más amhlaidh a briseadh as do phost thú, ba cheart duit a dheimhniú an raibh bun cóir ag do bhfostóir thú a bhriseadh

source: If you are concerned about your dismissal you should find out more about your rights under unfair dismissals legislation
ga: Más cás leat do bhriseadh ba cheart duit eolas a chur ar do chearta de bhun na reachtaíochta faoi dhífhostú éagórach

source: When you lose your job you are entitled to notice and you may also be entitled to payment in lieu of wages and for holidays
ga: Má chailleann tú do phost tá tú i dteideal fógra agus b'fhéidir go bhfuil teideal agat freisin ar íocaíocht in ionad pá agus laethanta saoire

source: When you lose your job you should register as unemployed with your local social welfare office or Intreo centre even if you do not qualify for an unemployment payment
ga: Má chailleann tú do phost ba cheart duit clárú mar dhuine dífhostaithe le d' oifig leasa shóisialaigh áitiúil nó ionad Intreo fiú amháin mura bhfuil tú i dteideal íocaíochta dífhostaíochta

source: You may be able to sign on for credited PRSI contributions so that you do not have a break in your social insurance record
ga: B'fhéidir go bhféadfaidh tú clárú le haghaidh ranníocaíochtaí ÁSPC a chuirfear chun sochair sa chaoi is nach mbeidh briseadh i stair d'árachais shóisialaigh

source: You may be entitled to a tax refund if you have been out of work for some time
ga: B'fhéidir go mbeidh teideal agat ar aisíoc cánach má tá tú dífhostaithe le tamall

source: When you leave your job your employer should give you your P45 which is a record of your tax and PRSI paid
ga: Agus tú ag fágáil do phoist ba cheart go dtabharfadh d'fhostóir d'fhoirm P45 duit, ar taifead é ar an gcáin agus ar an ÁSPC a d'íoc tú

source: If it is the end of a tax year your employer should give you a P60
ga: Más é deireadh na bliana cánach é, ba cheart go dtabharfadh d'fhostóir foirm P60 duit

source: Social welfare and other benefits
ga: Leas sóisialach agus sochair eile

source: You may be entitled to an unemployment social welfare payment
ga: B'fhéidir go mbeidh teideal agat ar íocaíocht leasa shóisialaigh don dífhostaíocht

source: If you have enough social insurance contributions you may be entitled to Jobseeker’s Benefit
ga: Má tá do dhóthain ranníocaíochtaí árachais shóisialta déanta agat, b'fhéidir go mbeidh teideal agat ar Shochar Cuardaitheora Poist

source: If you do not have enough PRSI contributions you may qualify for Jobseeker’s Allowance which is a means-tested benefit
ga: Mura bhfuil do dhóthain ranníocaíochtaí ÁSPC déanta agat, b'fhéidir go mbeidh teideal agat ar Liúntas Cuardaitheora Poist, ar sochar de réir tástála acmhainne é

source: Depending on your circumstances you may qualify for a medical card or GP visit card and other secondary benefits such as Rent Supplement under the Supplementary Welfare Allowance Scheme
ga: De réir thosca do cháis, b'fhéidir go mbeidh teideal agat ar chárta leighis nó ar chárta cuairte LG agus ar bhuntáistí tánaisteacha eile, mar shampla Liúntas Forlíontach Cíosa de bhun na Scéime Liúntas Forlíontach Leasa Shóisialaigh

source: There are a number of sources of information to help you find a job including newspapers, recruitment agencies and websites
ga: Tá roinnt foinsí faisnéise ann a chabhróidh leat post a fháil, lena n-áirítear nuachtáin, gníomhaireachtaí earcaíochta agus láithreáin ghréasáin

source: There also are different organisations which can assist you
ga: Tá roinnt eagraíochtaí freisin ann a d'fhéadfadh cabhrú leat

source: You should register with your local employment services office or Intreo centre for information about job vacancies
ga: Ba cheart duit clárú leis an oifig seirbhísí fostaíochta áitiúil nó ionad Intreo le haghaidh faisnéise faoi fholúntais

source: Its employment services for jobseekers also include career guidance and information about Job Clubs and training courses
ga: Áiríonn na seirbhísí fostaíochta do chuardaitheoirí phoist gairmthreoir agus faisnéis faoi Jab-Chlubanna agus faoi chúrsaí oiliúna freisin

source: Local Employment Services (LES) assist long-term unemployed people through training and career guidance to progress from social welfare to work
ga: Bíonn na Seirbhísí Fostaíochta Áitiúla ag cabhrú le daoine atá dífhostaithe le fada, trí bhíthin oiliúna agus gairmthreorach, sa chaoi is go malartóidh siad an leas sóisialach ar an obair

source: There are employment schemes for long-term unemployed people such as Community Employment
ga: Tá scéimeanna fostaíochta ann do dhaoine atá dífhostaithe le fada, mar shampla Fostaíocht Pobail

source: After losing your job you may decide to return to education or vocational training, perhaps changing direction in your career
ga: Tar éis duit do phost a chailliúint b'fhéidir gur mhaith leat filleadh ar an oideachas nó ar an oiliúint ghairmiúil, agus b'fhéidir do ghairmréim a athrú

source: There is a wide range of education and training programmes offering full-time and part-time courses
ga: Tá raon leathan clár oideachais agus oiliúna ann a chuireann cúrsaí lánaimseartha agus páirtaimseartha ar fáil

source: The courses include Further Education and Training (FET) courses and courses provided by Education and Training Boards (ETBs)
ga: Áiríonn na cúrsaí seo cúrsaí Breisoideachais agus Oiliúna (FET) agus cúrsaí a chuireann na Boird Oideachais agus Oiliúna (BOO) ar fáil

source: If you are on an unemployment payment you may be eligible for the Vocational Training Opportunities Scheme (VTOS) or the Back to Education Allowance
ga: Má tá tú ag fáil íocaíochta dífhostaíochta b'fhéidir go mbeidh tú incháilithe don Scéim Deiseanna Oiliúna Gairmoideachais (SDOG) nó don Liúntas chun Filleadh ar an Oideachas

source: When you are returning to work you should make sure that your tax and PRSI deductions are correct
ga: Agus tú ag filleadh ar an obair ba cheart duit deimhin a dhéanamh de go bhfuil do chuid asbhaintí cánach agus ÁSPC ceart

source: You should let your local social welfare office or Intreo centre know when you are starting work
ga: Ba cheart duit a insint do d'oifig leasa shóisialaigh áitiúil nó ionad Intreo cén uair a thosóidh tú ag obair

source: If you are taking up self-employment you may be eligible for the Back to Work Enterprise Allowance
ga: Má tá tú ag dul i mbun na féinfhostaíochta b'fhéidir go mbeidh teideal agat ar an Liúntas Fiontraíochta um Fhilleadh ar Obair
